app/controllers/api/v1/pins_controller.rb

SELECT "pins".* FROM "pins" ORDER BY created_at DESC
---
  def index
    render json: Pin.all.order('created_at DESC')